/*
 * =====================================================================================
 *
 *       Filename:  1.c
 *
 *    Description:  实现一级主菜单的第一个功能，即校园平面图的展示
 *
 *        Version:  1.0
 *        Created:  2013年12月09日 09时53分42秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  lgt, lgtcarol@gmail.com
 *        Company:  Class 1203
 *
 * =====================================================================================
 */

void PrintView(void)
{
	printf("     ><><><><><><><><><马<><><><><><><><><><><><><><><><><><><><><><>>路<><><><><><><><>  \n");
	printf(" 					 ——————————————                             \n");
	printf(" 					【1.西 邮 正 门】                            \n");
	printf(" 					 ——————————————	                            \n");
	printf("                                            | |                                         \n");
	printf("                                            | |                                        \n");
	printf("                 【4.教学楼】 ———————————————    ——————————————【2.行政楼】                 \n");
	printf("                                           【3.喷泉】                                        \n");
	printf("                                           /    \\                                    \n");
	printf("                                         /   | |   \\                                 \n");
	printf("                                       /     | |      \\                               \n");
	printf("     【6.实验楼】————————————————————————    | |        \\                             \n");
	printf("                                    \\       | |         【5.大学生活动中心】                             \n");
	printf("                                       \\                                        \n");
	printf("                                            【7.图书馆】                                       \n");
	printf("                                         /  | |                                    \n");
	printf("                                       /    | |                                  \n");
	printf("                                     /      | |   \\                               \n");
	printf("                         ————————           | |     \\                               \n");
	printf("                       /\\                  | |    ——————>>>【9.体育馆】              \n");
	printf("          【8.洗浴中心兼医务室】            | |      /          \\                               \n");
	printf("                | |                   | |   | |                \\                  \n");
	printf("                | |                 | |     | |                  \\             \n");
	printf("          【11.美食广场】         | |       | |                    \\                    \n");
	printf("            \\                     /        | |                     ||        \n");
	printf("              \\                 /          | |                     ||         \n");
	printf("                \\        【10.土操场】     | |                     ||                \n");
	printf("                  \\          /             | |                      \\              \n");
	printf("                    \\       /             【12.旭日院】                 \\              \n");
	printf("                     \\    /             /            \\                    \\ \n");
	printf("             【13.1-6#公寓】<<<< ——————————【12.超市】———————— >>>>【14.10-16#公寓】      \n");
	printf("                                                                                \n");
	printf("     ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^   学校后墙     ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^                          \n");
}
